students = [
    ("Анна", 19, ["Математика", "Информатика"]),
    ("Иван", 22, ["Физика", "Информатика"]),
    ("Мария", 19, ["Литература", "Искусство"]),
    ("Алексей", 20, ["Химия", "Биология"]),
    ("Елена", 21, ["Физика", "Искусство"]),
    ("Дмитрий", 18, ["Математика", "Литература"]),
    ("Ольга", 22, ["Информатика", "Биология"]),
    ("Павел", 20, ["Искусство", "Физика"]),
    ("Алина", 19, ["Информатика", "Математика"]),
    ("Артем", 21, ["Биология", "Химия"]),
    ("Наталья", 18, ["Литература", "Искусство"]),
    ("Сергей", 23, ["Информатика", "Физика"]),
    ("Евгения", 20, ["Химия", "Биология"]),
    ("Андрей", 24, ["Искусство", "Литература"]),
    ("Виктория", 22, ["Физика", "Информатика"]),
    ("Максим", 19, ["Биология", "Химия"]),
    ("Юлия", 21, ["Информатика", "Физика"]),
    ("Кирилл", 20, ["Математика", "Биология"]),
    ("Анастасия", 23, ["Литература", "Искусство"]),
    ("Роман", 18, ["Информатика", "Физика"]),
]
subject = set()
data_younger = set()
data_older = set()

for i in range(len(students)):
    if students[i][1] < 21:
        for j in range(len(students[i][2])):
            subject.add(students[i][2][j])
        data_younger.add(students[i][0])
    else:
        for j in range(len(students[i][2])):
            subject.add(students[i][2][j])
        data_older.add(students[i][0])

print(" ".join(sorted(subject)))
print(" ".join(sorted(data_younger)))
print(" ".join(sorted(data_older)))